---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DetailNurbSpline
source: html/b1203bf7-4735-7d0f-e8ac-615b388394d3.htm
---
# DetailNurbSpline Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.